# Homebrew features
tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "mas"

# Essentials
# (See also: Brewfile.frontload)
cask "syncthing"
cask "visual-studio-code"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "bartender"

mas "Pastebot", id: 1179623856
mas "Xcode", id: 497799835

# Binaries for Vim plugins:
brew "hadolint"
brew "selene"
brew "shellcheck"
brew "stylua"
brew "tidy-html5"
brew "yamllint"

# Everything else, except services
# (Some Casks that I want to override MAS)
cask "daisydisk"

mas "Acorn", id: 1547371478
mas "Amphetamine", id: 937984704
mas "Banktivity", id: 1480779512
mas "Boom 2", id: 948176063
mas "Brother P-touch Editor", id: 1453365242
mas "Clear", id: 504544917
mas "Color Picker", id: 1545870783
mas "Deliveries", id: 290986013
mas "Droplr", id: 498672703
mas "Fantastical", id: 975937182
mas "Focus", id: 777233759
mas "Forecast Bar", id: 982710545
mas "Geofency", id: 615538630
mas "Harvest", id: 506189836
mas "Hex Fiend", id: 1342896380
mas "Internet Access Policy Viewer", id: 1482630322
mas "Pasteboard Viewer", id: 1499215709
mas "PCalc", id: 403504866
mas "PDF Expert", id: 1055273043
mas "Pixea", id: 1507782672
mas "Reeder", id: 1529448980
mas "Soulver 3", id: 1508732804
mas "Speedtest", id: 1153157709
mas "Synalyze It!", id: 417074533
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Transmit", id: 1436522307
mas "Tunes Notifier", id: 555731861
mas "Twitter", id: 1482454543
mas "Xee³", id: 639764244
mas "xScope", id: 889428659

brew "ack"
brew "aria2"
brew "asciinema"
brew "bat"
brew "bats"
brew "icu4c"
brew "pcre"
brew "chicken"
brew "cloc"
brew "cmatrix"
brew "curl"
brew "ddrescue"
brew "docker"
brew "exa"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "git-cal"
brew "git-delta"
brew "git-lfs"
brew "github-release"
brew "gnu-typist"
brew "gnupg"
brew "googler"
brew "gptfdisk"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jansson"
brew "jq"
brew "leiningen"
brew "less"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "nasm"
brew "nmap"
brew "pgpdump"
brew "pinentry-mac"
brew "prettyping"
brew "pv"
brew "ranger"
brew "ripgrep"
brew "rlwrap"
brew "speedtest-cli"
brew "sphinx-doc"
brew "swig"
brew "tealdeer"
brew "telnet"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "yasm"
brew "ykman"
brew "youtube-dl"

cask "anki"
cask "betterdiscord-installer"
cask "colorsnapper"
cask "discord"
cask "dotnet-sdk"
cask "google-chrome"
cask "ilspy"
cask "ipfs"
cask "kaleidoscope"
cask "keycastr"
cask "lingon-x"
cask "mono-mdk"
cask "monodraw"
cask "nightowl"
cask "notion"
cask "omnigraffle"
cask "rescuetime"
cask "signal"
cask "slack"
cask "steam"
cask "tower"
cask "vlc"
cask "Homebrew/homebrew-cask-drivers/yubico-authenticator"
cask "zoom"

# Services
brew "unbound"
brew "tor"
brew "languagetool"

# https://dev.languagetool.org/finding-errors-using-n-gram-data
tap "ELLIOTTCABLE/homebrew-languagetool-ngrams"
brew "languagetool-ngrams-en"
